app/test/artillery/flow.yaml
config:
  pluggins:
    metrics-by-endpoint : {}
  target: http://localhost:8080/api
  phases:
    - duration: 10
      arrivalRate: 50
scenarios:
  - name: login
    flow:
      - log: login
      - post: 
          url: /sessions/login
          json:
            email: valen@gmail.com
            password: hola1234
      - log: read all products
      - get:
          url: /products
      # - log: create product
      # - post:
      #     url: /products
      #     json:
      #       title: pepe  
      #       category: placa